archive/before-2018-11-10/2017-07-07-python-装钸器.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4f0b621">1. 装钸器</a></li>
<li><a href="#org92b5604">2. 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4f0b621" class="outline-2">
<h2 id="org4f0b621"><span class="section-number-2">1</span> 装钸器</h2>
<div class="outline-text-2" id="text-1">
<p>
在python中，函数是对象。可以进行赋值等操作：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">-*- coding: utf-8; -*-</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">hi</span>(name=<span style="color: #ff4ea3;">"yasoob"</span>):
        <span style="color: #a1db00;">return</span> <span style="color: #ff4ea3;">"hi "</span> + name

    <span style="color: #a1db00;">print</span>(hi())
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">output: 'hi yasoob'</span>

    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#25105;&#20204;&#29978;&#33267;&#21487;&#20197;&#23558;&#19968;&#20010;&#20989;&#25968;&#36171;&#20540;&#32473;&#19968;&#20010;&#21464;&#37327;&#65292;&#27604;&#22914;</span>
    <span style="color: #ff8700;">greet</span> = hi
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#25105;&#20204;&#36825;&#37324;&#27809;&#26377;&#22312;&#20351;&#29992;&#23567;&#25324;&#21495;&#65292;&#22240;&#20026;&#25105;&#20204;&#24182;&#19981;&#26159;&#22312;&#35843;&#29992;hi&#20989;&#25968;</span>
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#32780;&#26159;&#22312;&#23558;&#23427;&#25918;&#22312;greet&#21464;&#37327;&#37324;&#22836;&#12290;&#25105;&#20204;&#23581;&#35797;&#36816;&#34892;&#19979;&#36825;&#20010;</span>

    <span style="color: #a1db00;">print</span>(greet())
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">output: 'hi yasoob'</span>

    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#22914;&#26524;&#25105;&#20204;&#21024;&#25481;&#26087;&#30340;hi&#20989;&#25968;&#65292;&#30475;&#30475;&#20250;&#21457;&#29983;&#20160;&#20040;&#65281;</span>
    <span style="color: #a1db00;">del</span> hi
    <span style="color: #a1db00;">print</span>(hi())
    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">outputs: NameError</span>

    <span style="color: #a1db00;">print</span>(greet())
    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">outputs: 'hi yasoob'</span>

</pre>
</div>

<p>
函数中可以定义函数：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">out_fun</span>():

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">inter_fun1</span>():
            <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'in inter_fun1'</span>

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">inter_fun2</span>():
            <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'in inter_fun2'</span>
        
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'begin out_fun'</span>

        inter_fun1()
        inter_fun2()
    
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'end_out_fun'</span>
    
    out_fun()
</pre>
</div>

<p>
内部的 <code>inter_fun1</code> 和 <code>inter_fun2</code> 在外部是不可见的。
</p>

<p>
函数也可以返回函数：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">re_fun</span>():
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'in re_fun'</span>

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">hi</span>():
            <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'hi this is the returned function'</span>
            <span style="color: #a1db00;">return</span> <span style="color: #ff4ea3;">'this is return value'</span>

        <span style="color: #a1db00;">return</span> hi


    <span style="color: #ff8700;">a</span> = re_fun()

    <span style="color: #a1db00;">print</span> a()
</pre>
</div>

<p>
函数也可以做为参数传递给另一个函数：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">a</span>(fun):
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'a will call function %s'</span> % fun.<span style="color: #d18aff;">__name__</span>
        fun()

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">hi</span>():
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'hi'</span>

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">hello</span>():
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'hello,world'</span>
    
    a(hi)
    a(hello)
</pre>
</div>

<p>
装钸器就是让你能在你的函数的前后去执行代码：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">a_new_decorator</span>(a_func):

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrapTheFunction</span>():
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am doing some boring work before executing a_func()"</span>)

            a_func()

            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am doing some boring work after executing a_func()"</span>)

        <span style="color: #a1db00;">return</span> wrapTheFunction

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">a_function_requiring_decoration</span>():
        <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am the function which needs some decoration to remove my foul smell"</span>)

    a_function_requiring_decoration()
    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">outputs: "I am the function which needs some decoration to remove my foul smell"</span>

    <span style="color: #ff8700;">a_function_requiring_decoration</span> = a_new_decorator(a_function_requiring_decoration)
    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">now a_function_requiring_decoration is wrapped by wrapTheFunction()</span>

    a_function_requiring_decoration()
    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">outputs:I am doing some boring work before executing a_func()</span>
    <span style="color: #6c6c6c; font-style: italic;">#        </span><span style="color: #6c6c6c; font-style: italic;">I am the function which needs some decoration to remove my foul smell</span>
    <span style="color: #6c6c6c; font-style: italic;">#        </span><span style="color: #6c6c6c; font-style: italic;">I am doing some boring work after executing a_func()</span>
</pre>
</div>

<p>
如果我们按照python中的语法来写的话，这个装钸器应该是这样的：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">a_new_decorator</span>(a_func):

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrapTheFunction</span>():
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am doing some boring work before executing a_func()"</span>)

            a_func()

            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am doing some boring work after executing a_func()"</span>)

        <span style="color: #a1db00;">return</span> wrapTheFunction

    <span style="color: #00d7af;">@a_new_decorator</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">a_function_requiring_decoration</span>():
        <span style="color: #ff4b4b;">"""Hey you! Decorate me!"""</span>
        <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am the function which needs some decoration to "</span>
              <span style="color: #ff4ea3;">"remove my foul smell"</span>)

    a_function_requiring_decoration()
    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">outputs: I am doing some boring work before executing a_func()</span>
    <span style="color: #6c6c6c; font-style: italic;">#         </span><span style="color: #6c6c6c; font-style: italic;">I am the function which needs some decoration to remove my foul smell</span>
    <span style="color: #6c6c6c; font-style: italic;">#         </span><span style="color: #6c6c6c; font-style: italic;">I am doing some boring work after executing a_func()</span>

    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">the @a_new_decorator is just a short way of saying:</span>
    <span style="color: #ff8700;">a_function_requiring_decoration</span> = a_new_decorator(a_function_requiring_decoration)
</pre>
</div>

<p>
但是这样会有一个问题：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">a_new_decorator</span>(a_func):

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrapTheFunction</span>():
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am doing some boring work before executing a_func()"</span>)

            a_func()

            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am doing some boring work after executing a_func()"</span>)

        <span style="color: #a1db00;">return</span> wrapTheFunction

    <span style="color: #00d7af;">@a_new_decorator</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">a_function_requiring_decoration</span>():
        <span style="color: #ff4b4b;">"""Hey you! Decorate me!"""</span>
        <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am the function which needs some decoration to "</span>
              <span style="color: #ff4ea3;">"remove my foul smell"</span>)

    a_function_requiring_decoration()
    <span style="color: #ff8700;">a_function_requiring_decoration</span> = a_new_decorator(a_function_requiring_decoration)

    <span style="color: #a1db00;">print</span> a_function_requiring_decoration.<span style="color: #d18aff;">__name__</span>
</pre>
</div>

<p>
最后函数的 <code>__name__</code> 属性被覆盖了。这并不是我们想要的。python中有一
个 <code>functools.wraps</code> 可以用来解决这个问题，他可以保留被装钸的函数的
<code>__name__</code> 和 <code>__doc__</code> 属性。
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> wraps

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">a_new_decorator</span>(a_func):
        <span style="color: #00d7af;">@wraps</span>(a_func)
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrapTheFunction</span>():
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am doing some boring work before executing a_func()"</span>)
            a_func()
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am doing some boring work after executing a_func()"</span>)
        <span style="color: #a1db00;">return</span> wrapTheFunction

    <span style="color: #00d7af;">@a_new_decorator</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">a_function_requiring_decoration</span>():
        <span style="color: #ff4b4b;">"""Hey yo! Decorate me!"""</span>
        <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"I am the function which needs some decoration to "</span>
              <span style="color: #ff4ea3;">"remove my foul smell"</span>)

    <span style="color: #a1db00;">print</span>(a_function_requiring_decoration.<span style="color: #d18aff;">__name__</span>)
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Output: a_function_requiring_decoration</span>
</pre>
</div>

<p>
web应用认证的时候常用装钸器来这样写：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> wraps

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">requires_auth</span>(f):
        <span style="color: #00d7af;">@wraps</span>(f)
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">decorated</span>(*args, **kwargs):
            <span style="color: #ff8700;">auth</span> = request.authorization
            <span style="color: #a1db00;">if</span> <span style="color: #a1db00;">not</span> auth <span style="color: #a1db00;">or</span> <span style="color: #a1db00;">not</span> check_auth(auth.username, auth.password):
                authenticate()
            <span style="color: #a1db00;">return</span> f(*args, **kwargs)
        <span style="color: #a1db00;">return</span> decorated
</pre>
</div>

<p>
记录日志也是常使用的：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> wraps

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">logit</span>(func):
        <span style="color: #00d7af;">@wraps</span>(func)
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">with_logging</span>(*args, **kwargs):
            <span style="color: #a1db00;">print</span>(func.<span style="color: #d18aff;">__name__</span> + <span style="color: #ff4ea3;">" was called"</span>)
            <span style="color: #a1db00;">return</span> func(*args, **kwargs)
        <span style="color: #a1db00;">return</span> with_logging

    <span style="color: #00d7af;">@logit</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">addition_func</span>(x):
       <span style="color: #ff4b4b;">"""Do some math."""</span>
       <span style="color: #a1db00;">return</span> x + x


    <span style="color: #ff8700;">result</span> = addition_func(4)
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Output: addition_func was called</span>
</pre>
</div>

<p>
如果需要定义带参数的装钸器：
</p>
<div class="org-src-container">
<pre class="src src-python" id="orgb79f752">    <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> wraps

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">logit</span>(logfile=<span style="color: #ff4ea3;">'out.log'</span>):
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">logging_decorator</span>(func):
            <span style="color: #00d7af;">@wraps</span>(func)
            <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrapped_function</span>(*args, **kwargs):
                <span style="color: #ff8700;">log_string</span> = func.<span style="color: #d18aff;">__name__</span> + <span style="color: #ff4ea3;">" was called"</span>
                <span style="color: #a1db00;">print</span>(log_string)
                <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#25171;&#24320;logfile&#65292;&#24182;&#20889;&#20837;&#20869;&#23481;</span>
                <span style="color: #a1db00;">with</span> <span style="color: #d18aff;">open</span>(logfile, <span style="color: #ff4ea3;">'a'</span>) <span style="color: #a1db00;">as</span> opened_file:
                    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#29616;&#22312;&#23558;&#26085;&#24535;&#25171;&#21040;&#25351;&#23450;&#30340;logfile</span>
                    opened_file.write(log_string + <span style="color: #ff4ea3;">'\n'</span>)
                <span style="color: #a1db00;">return</span> func(*args, **kwargs)
            <span style="color: #a1db00;">return</span> wrapped_function
        <span style="color: #a1db00;">return</span> logging_decorator

    <span style="color: #00d7af;">@logit</span>()
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">myfunc1</span>():
        <span style="color: #a1db00;">pass</span>

    myfunc1()
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Output: myfunc1 was called</span>
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#29616;&#22312;&#19968;&#20010;&#21483;&#20570; out.log &#30340;&#25991;&#20214;&#20986;&#29616;&#20102;&#65292;&#37324;&#38754;&#30340;&#20869;&#23481;&#23601;&#26159;&#19978;&#38754;&#30340;&#23383;&#31526;&#20018;</span>

    <span style="color: #00d7af;">@logit</span>(logfile=<span style="color: #ff4ea3;">'func2.log'</span>)
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">myfunc2</span>():
        <span style="color: #a1db00;">pass</span>

    myfunc2()
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Output: myfunc2 was called</span>
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#29616;&#22312;&#19968;&#20010;&#21483;&#20570; func2.log &#30340;&#25991;&#20214;&#20986;&#29616;&#20102;&#65292;&#37324;&#38754;&#30340;&#20869;&#23481;&#23601;&#26159;&#19978;&#38754;&#30340;&#23383;&#31526;&#20018;</span>
</pre>
</div>

<p>
可以类似于这样来理解：
</p>
<div class="org-src-container">
<pre class="src src-python">    logit(logfile=<span style="color: #ff4ea3;">'out.log'</span>)(myfunc1)
    logit(logfile=<span style="color: #ff4ea3;">'func2.log'</span>)(myfunc2)
</pre>
</div>

<p>
函数式编程，函数是第一类数据，可以做为参数传递，也可以做为返回值。所
以这种带参数的装钸器执行就是类似于上面这样。
</p>

<p>
装钸器还可以实现为一个类，这就更灵活啦。比如上面的记录日志的同时，还
想再发邮件给管理员。
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> wraps


    <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">clogit</span>(<span style="color: #d18aff;">object</span>):
        <span style="color: #ff4b4b;">"""Documentation for clogit</span>

<span style="color: #ff4b4b;">        """</span>
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, logfile):
            <span style="color: #d18aff;">super</span>(clogit, <span style="color: #a1db00;">self</span>).__init__()
            <span style="color: #a1db00;">self</span>.logfile = logfile

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__call__</span>(<span style="color: #a1db00;">self</span>, func):
            <span style="color: #00d7af;">@wraps</span>(func)
            <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrapper</span>(*args, **kargs):
                <span style="color: #ff8700;">logstring</span> = <span style="color: #ff4ea3;">'function %s is called'</span> % func.<span style="color: #d18aff;">__name__</span>
                func(*args, **kargs)

                <span style="color: #a1db00;">with</span> <span style="color: #d18aff;">open</span>(<span style="color: #a1db00;">self</span>.logfile, <span style="color: #ff4ea3;">'wb'</span>) <span style="color: #a1db00;">as</span> f:
                    f.write(logstring)

                <span style="color: #a1db00;">self</span>.notify(logstring)

            <span style="color: #a1db00;">return</span> wrapper

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">notify</span>(<span style="color: #a1db00;">self</span>, s):
            <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">clogit not notify</span>
            <span style="color: #a1db00;">pass</span>

    <span style="color: #00d7af;">@clogit</span>(<span style="color: #ff4ea3;">'/tmp/logit'</span>)
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">function_test</span>():
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'this is function'</span>

    function_test()
</pre>
</div>

<p>
这个感觉有点像：
</p>
<div class="org-src-container">
<pre class="src src-python">    clogit(<span style="color: #ff4ea3;">'/tmp/logit'</span>).__call__(function_test)
</pre>
</div>

<p>
它比 <a href="#orgb79f752">嵌套函数的方式</a> 更整洁一些。而且扩展也很方便啦，现在我们可以定义
一个可以发邮件的子类：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> wraps


    <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">clogit</span>(<span style="color: #d18aff;">object</span>):
        <span style="color: #ff4b4b;">"""Documentation for clogit</span>

<span style="color: #ff4b4b;">        """</span>
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, logfile=<span style="color: #ff4ea3;">'/tmp/logit'</span>):
            <span style="color: #d18aff;">super</span>(clogit, <span style="color: #a1db00;">self</span>).__init__()
            <span style="color: #a1db00;">self</span>.logfile = logfile

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__call__</span>(<span style="color: #a1db00;">self</span>, func):
            <span style="color: #00d7af;">@wraps</span>(func)
            <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrapper</span>(*args, **kargs):
                <span style="color: #ff8700;">logstring</span> = <span style="color: #ff4ea3;">'function %s is called'</span> % func.<span style="color: #d18aff;">__name__</span>
                func(*args, **kargs)

                <span style="color: #a1db00;">with</span> <span style="color: #d18aff;">open</span>(<span style="color: #a1db00;">self</span>.logfile, <span style="color: #ff4ea3;">'wb'</span>) <span style="color: #a1db00;">as</span> f:
                    f.write(logstring)

                <span style="color: #a1db00;">self</span>.notify(logstring)

            <span style="color: #a1db00;">return</span> wrapper

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">notify</span>(<span style="color: #a1db00;">self</span>, s):
            <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">clogit not notify</span>
            <span style="color: #a1db00;">pass</span>


    <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">email_andlogit</span>(clogit):
        <span style="color: #ff4b4b;">"""Documentation for email_andlogit</span>

<span style="color: #ff4b4b;">        """</span>
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, emailaddress=<span style="color: #ff4ea3;">'xxx@gmail.com'</span>, *args, **kargs):
            <span style="color: #d18aff;">super</span>(email_andlogit, <span style="color: #a1db00;">self</span>).__init__(*args, **kargs)
            <span style="color: #a1db00;">self</span>.emailaddress = emailaddress

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">notify</span>(<span style="color: #a1db00;">self</span>, s):
            <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'I will email %s to %s'</span> % (s, <span style="color: #a1db00;">self</span>.emailaddress)
            <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">send email here</span>

    <span style="color: #00d7af;">@email_andlogit</span>(<span style="color: #ff4ea3;">'peng@gmail.com'</span>, <span style="color: #ff4ea3;">'/tmp/emaillogit'</span>)
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">test_email</span>():
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'this is function'</span>
    test_email()
</pre>
</div>

<p>
这样， <code>email_andlogit</code> 不仅会写入日志，还会发送一封邮件给管理员啦。
</p>

<p>
最后，有一个问题：再思考一下能否写出一个 <code>@log</code> 的 <code>decorator</code> ，使
它既支持：
</p>
<pre class="example">
    @log
    def f():
        pass
</pre>
<p>
又支持
</p>
<pre class="example">
    @log('execute')
    def f():
        pass
</pre>

<p>
下面是解法，有点复杂，需要慢慢理解下。
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">-*- coding: utf-8; -*-</span>
    <span style="color: #a1db00;">import</span> functools
    

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">log</span>(args):
        <span style="color: #ff4b4b;">''' &#20989;&#25968;Log&#35013;&#39280;&#22120; '''</span>
        <span style="color: #ff8700;">desc</span> = <span style="color: #ff4ea3;">'Just call!'</span>
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">decoration</span>(func):
            <span style="color: #ff4b4b;">''' &#35013;&#39280;&#22120; '''</span>
            <span style="color: #00d7af;">@functools.wraps</span>(func)
            <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrapper</span>(*K, **KM):
                <span style="color: #ff4b4b;">''' &#25191;&#34892;&#35013;&#39280;&#22120;&#21442;&#25968;&#20989;&#25968; '''</span>
                <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'[+] Function Execute: '</span> + func.<span style="color: #d18aff;">__name__</span> + <span style="color: #ff4ea3;">' ('</span> + desc + <span style="color: #ff4ea3;">')'</span>
                <span style="color: #ff8700;">result</span> = func(*K, **KM)
                <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'[+] Function Finished: '</span> + func.<span style="color: #d18aff;">__name__</span> + <span style="color: #ff4ea3;">' ('</span> + desc + <span style="color: #ff4ea3;">')'</span>
                <span style="color: #a1db00;">return</span> result
            <span style="color: #a1db00;">return</span> wrapper

        <span style="color: #a1db00;">if</span> <span style="color: #d18aff;">hasattr</span>(args, <span style="color: #ff4ea3;">'__call__'</span>):
            <span style="color: #a1db00;">return</span> decoration(args)
        <span style="color: #a1db00;">else</span>:
            <span style="color: #ff8700;">desc</span> = args
            <span style="color: #a1db00;">return</span> decoration

    <span style="color: #00d7af;">@log</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">fun_log</span>():
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'fun_log'</span>

    <span style="color: #00d7af;">@log</span>(<span style="color: #ff4ea3;">'[test]'</span>)
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">fun_test</span>():
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'fun_test'</span>


    fun_log()
    <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'================'</span>
    fun_test()
</pre>
</div>

<p>
我理解 <code>@log('tet')</code> 这种形式的时候，参数 <code>tet</code> 是放到了一个闭包里面
的。直到函数调用结束，闭包才释放掉。
</p>
</div>
</div>

<div id="outline-container-org92b5604" class="outline-2">
<h2 id="org92b5604"><span class="section-number-2">2</span> 参考资料</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://eastlakeside.gitbooks.io/interpy-zh/content/decorators/">pyhton-进阶中文版</a></li>
<li><a href="http://www.liaoxuefeng.com/wiki/001374738125095c955c1e6d8bb493182103fac9270762a000/001386819879946007bbf6ad052463ab18034f0254bf355000">廖雪峰讲python装钸器</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>